---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.FeedThroughLugsIsNotEnabledAndBindFormulaInFamily
source: html/0c8f369e-06dc-081e-1148-5ae85558fbbc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.FeedThroughLugsIsNotEnabledAndBindFormulaInFamily Property

Can't change connection type to Feed Through Lugs because Feed Through Lugs is unchecked. Enable Feed Through Lugs with related formula in family editor the Feed Through Lugs is mapped to. Select the panel -> Edit Family -> Family Types.

## Syntax (C#)
```csharp
public static FailureDefinitionId FeedThroughLugsIsNotEnabledAndBindFormulaInFamily { get; }
```